#include "board.h"
#include "delay.h"
#include "ZDT_X57.h"

/**********************************************************
***	ZDT_X57步进闭环控制例程
***	编写作者：ZHANGDATOU
***	技术支持：张大头闭环伺服
***	淘宝店铺：https://zhangdatou.taobao.com
***	CSDN博客：http s://blog.csdn.net/zhangdatou666
***	qq交流群：262438510
**********************************************************/

/**
	*	@brief		MAIN函数
	*	@param		无
	*	@retval		无
	*/
int main(void)
{
/**********************************************************
***	初始化板载外设
**********************************************************/
	board_init();

/**********************************************************
***	上电延时2秒等待X57闭环初始化完毕
**********************************************************/	
	delay_ms(2000);

/**********************************************************
***	梯形曲线位置模式：
	*		加速加速度		：1000RPM/s
	*		减速加速度		：1000RPM/s
	*		最大速度  		：2000RPM
	*		相对位置运动	：-36000.0°
**********************************************************/	
//出起始区	
	ZDT_X57_Traj_Position_Control(1, 0, 1000, 1000, 2000.0f, 231.0f, 0, 0);
	ZDT_X57_Traj_Position_Control(2, 1, 1000, 1000, 2000.0f, 231.0f, 0, 0);
	ZDT_X57_Traj_Position_Control(3, 1, 1000, 1000, 2000.0f, 231.0f, 0, 0);
	ZDT_X57_Traj_Position_Control(4, 0, 1000, 1000, 2000.0f, 231.0f, 0, 0);
	
	delay_ms(2000);
//走直线到二维码扫描区
	ZDT_X57_Traj_Position_Control(1, 1, 1000, 1000, 2000.0f, 856.0f, 0, 0);
	ZDT_X57_Traj_Position_Control(2, 1, 1000, 1000, 2000.0f, 856.0f, 0, 0);
	ZDT_X57_Traj_Position_Control(3, 1, 1000, 1000, 2000.0f, 856.0f, 0, 0);
	ZDT_X57_Traj_Position_Control(4, 1, 1000, 1000, 2000.0f, 856.0f, 0, 0);
	delay_ms(8000);
/**********************************************************
***	等待返回命令，返回数据缓存在can.CAN_RxMsg，长度为can.CAN_RxMsg.DLC
**********************************************************/	
	while(can.rxFrameFlag == false); can.rxFrameFlag = false;

/**********************************************************
***	WHILE循环
**********************************************************/	
	while(1)
	{
	}
}
